package com.hxut13.java2;

/**
 * @author weijiangquan
 * @date 2022/4/25 -20:06
 *
 * java.lang.Object
 * 1.Object类是所有Java类的根父类
 * 2.如果在类的声明中未只用extends关键字指明其父类，则默认父类是java.lang.Object
 * 3.Object类中的功能（属性和方法具有）通用性
 * 属性 ：无
 * 方法:equals() /toString /getClass() /hashCode() /finalize
 *      wait()  notify()  notifyAll()
 * 4.Object类只声明了一个空参构造器
 *
 *
 */
public class ObjectTest {
    public static void main(String[] args) {

    }
}
                   /*
                                    _ooOoo_
                                   o8888888o
                                   88" . "88
                                   (| -_- |)
                                   O\  =  /O
                                ____/`- -'\____
                              .'  \\|     |//  `.
                             /  \\|||  :  |||//  \
                            /  _||||| -:- |||||-  \
                            |   | \\\  -  /// |   |
                            | \_|  ''\- -/''  |   |
                            \  .-\__  `-`  ___/-. /
                          ___`. .'  /- . -\  `. . __
                       ."" '<  `.___\_<|>_/___.'  >'"".
                      | | :  `- \`.;`\ _ /`;.`/ - ` : | |
                      \  \ `-.   \_ __\ /__ _/   .-` /  /
                   ======`-.____`-.___\_____/___.-`____.-'======
                                    `=- -='
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
                           佛祖保佑       永无BUG
                   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^*/